cylinder/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

patches
(

    {
        name sidewall1_cyclicAMI;
        patchInfo
        {
            type cyclicAMI;
            neighbourPatch sidewall2_cyclicAMI;
            transform translational;
            separationVector (0 -97.6e-6 0);
        }
        constructFrom patches;
        patches (sidewall1);
    }

    {
        name sidewall2_cyclicAMI;
        patchInfo
        {
            type cyclicAMI;
            neighbourPatch sidewall1_cyclicAMI;
            transform translational;
            separationVector (0 97.6e-6 0);
        }
        constructFrom patches;
        patches (sidewall2);
    }

);

// ************************************************************************* //
