cylinder/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
     p
     {
         solver          GAMG;
         smoother        GaussSeidel;
         tolerance       1e-7;
         relTol          0.01;
     }

     Phi
     {
         $p;
     }

     U
     {
         solver          smoothSolver;
         smoother        GaussSeidel;
         tolerance       1e-8;
         relTol          0.1;
         nSweeps         1;
     }

}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent yes;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    equations
    {
        U               0.9;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
